package ru.drudenko.dnd.fragment.master;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.ListView;

import androidx.annotation.NonNull;
import androidx.fragment.app.ListFragment;

import java.util.ArrayList;

import ru.drudenko.dnd.activity.HelpActivity;
import ru.drudenko.dnd.adapter.SingleAdapter;
import ru.drudenko.dnd.model.CustomItem;


public class MasterHelpFragment extends ListFragment {

    private String[] data = new String[]{"Сражение", "Состояния", "Виды урона", "Укрытие", "Броня", "Оружие"};

    @Override
    public void onActivityCreated(Bundle savedInstanceState) {
        super.onActivityCreated(savedInstanceState);
        SingleAdapter adapter = new SingleAdapter(getActivity(), data);
        setListAdapter(adapter);
    }

    @Override
    public void onListItemClick(@NonNull ListView l, @NonNull View v, int position, long id) {
        super.onListItemClick(l, v, position, id);

        switch (position) {
            case 0:
                Intent intent = new Intent(getContext(), MasterActionActivity.class);
                startActivityForResult(intent, 0);

                break;
            case 1:
                intent = new Intent(getContext(), HelpActivity.class);

                ArrayList<CustomItem> m2 = new ArrayList<>();
                m2.add(new CustomItem("Безсознательный", "• Находящееся без сознания существо«недееспособно», не способно перемещаться и говорить, а также не осознаёт своё окружение.\n• Существо роняет всё, что держит, и падаетничком.\n• Существо автоматически проваливаетспасброски Силы и Ловкости."));
                m2.add(new CustomItem("Испуганный", "• Испуганное существо совершает с помехойпроверки характеристик и броски атаки, пока источник его страха находится в пределах его линии обзора.\n• Существо не способно добровольноприблизиться к источнику своего страха"));
                m2.add(new CustomItem("Невидимый", "• Невидимое существо невозможно увидеть безпомощи магии или особого чувства.  Местонахождение существа можно определить по шуму, который оно издаёт, или по оставленным им следам.\n• Броски атаки по невидимому существусовершаются с помехой, а его броски атаки с преимуществом."));
                m2.add(new CustomItem("Недееспособный", "• Недееспособное существо не может совершатьдействия и реакции"));
                m2.add(new CustomItem("Оглохший", "• Оглохшее существо ничего не слышит иавтоматически проваливает все проверкихарактеристик, связанные со слухом"));
                m2.add(new CustomItem("Опутанный", "• Скорость опутанного существа равна 0, и ононе получает выгоды ни от каких бонусов кскорости.\n• Броски атаки по такому существу совершаютсяс преимуществом, а его броски атаки спомехой.\n• Существо совершает с помехой спасброскиЛовкости"));
                m2.add(new CustomItem("Схваченный", "• Скорость схваченного существа равна 0.\n• Состояние оканчивается, если схватившийстановится недееспособен.\n• Это состояние также оканчивается, если какойлибо эффект выводит схваченное существо иззоны досягаемости того, кто его удерживает."));
                m2.add(new CustomItem("Окаманевший", "•Существо превращается в камень.\n• Существо «недееспособно», не способнодвигаться и говорить, а также не осознаёт своё окружение.\n• Броски атаки по существу совершаются спреимуществом.\n• Существо автоматически проваливаетспасброски Силы и Ловкости.\n• Существо получает сопротивление ко всемвидам урона, ядам и болезням"));
                m2.add(new CustomItem("Ослеплённый", "• Ослеплённое существо ничего не видит иавтоматически проваливает все проверкихарактеристик, связанные со зрением.\n• Броски атаки по такому существу совершаются спреимуществом, а его броски атаки совершаются с помехой"));
                m2.add(new CustomItem("Очарованный", "• Очарованное существо не может атаковатьтого, кто его очаровал, а также делать егоцелью умения или магического эффекта,причиняющего вред.\n• Искуситель совершает с преимуществом всепроверки характеристик при социальномвзаимодействии с очарованным существом."));
                m2.add(new CustomItem("Ошеломлённый/парализованный", "•Существо «недееспособно», не способноперемещаться.\n• Существо автоматически проваливаетспасброски Силы и Ловкости.\n• Броски атаки по существу совершаются спреимуществом"));
                m2.add(new CustomItem("Сбитый с ног", "• Сбитое с ног существо способно перемещатьсятолько ползком, пока не встанет, прервав темсамым это состояние.\n• Существо совершает с помехой броски атаки.\n• Броски атаки по существу совершаются спреимуществом, если нападающий находится впределах 5 футов от него. В противном случаеброски атаки совершаются с помехой"));
                m2.add(new CustomItem("Отравленный", "• Отравленное существо совершает с помехойброски атаки и проверки характеристик."));

                intent.putExtra("CustomItems", m2);

                startActivityForResult(intent, 0);

                break;
            case 2:
                intent = new Intent(getContext(), HelpActivity.class);

                ArrayList<CustomItem> m3 = new ArrayList<>();
                m3.add(new CustomItem("Дробящий", "Тяжёлые силовые атаки — молотом, падением, сдавливанием и т. п. — причиняют дробящий урон"));
                m3.add(new CustomItem("Звук", "Оглушительные звуковые волны, такие как от заклинания волна грома, причиняют урон звуком"));
                m3.add(new CustomItem("Излучение", "Урон излучением, причиняемый заклинанием небесный огонь жреца и карающим оружием ангела, опаляют плоть как огонь и переполняют дух силой"));
                m3.add(new CustomItem("Кислота", "Едкое дыхание чёрного дракона и растворяющая слизь чёрного пудинга причиняют урон кислотой"));
                m3.add(new CustomItem("Колющий", "Колющие и пронзающие атаки, включая удары копьём и укусы чудовищ, причиняют колющий урон"));
                m3.add(new CustomItem("Некротическая энергия.", "Некротическая энергия, излучаемая некоторой нежитью и такими заклинаниями как леденящее прикосновение, иссушают плоть и даже душу"));
                m3.add(new CustomItem("Огонь", "Красный дракон, выдыхающий пламя, и многие заклинания, создающие жар, причиняют урон огнём"));
                m3.add(new CustomItem("Психическая энергия", "Атаки силой разума, такие как у иллитидов, причиняют урон психической энергией."));
                m3.add(new CustomItem("Рубящий", "Мечи, топоры и когти чудовищ причиняют рубящий урон"));
                m3.add(new CustomItem("Силовое поле", "Силовое поле это чистая магия, сфокусированная в разрушительную силу. Чаще всего силовым полем причиняют урон заклинания, такие как волшебная стрела и божественное оружие"));
                m3.add(new CustomItem("Холод", "Лютый холод от копья ледяного дьявола и морозное дыхание белого дракона причиняют урон холодом"));
                m3.add(new CustomItem("Электричество", "Заклинание молния и дыханиесинего дракона причиняют урон электричеством"));
                m3.add(new CustomItem("Яд", "Ядовитые укусы и токсичное дыхание зелёного дракона причиняют урон ядом"));

                intent.putExtra("CustomItems", m3);

                startActivityForResult(intent, 0);
                break;
            case 3:
                intent = new Intent(getContext(), HelpActivity.class);
                ArrayList<CustomItem> m4 = new ArrayList<>();

                m4.add(new CustomItem("Укрытие на 1/2", "Бонус к КД +2"));
                m4.add(new CustomItem("Укрытие на 3/4", "Бонус к КД +5"));
                m4.add(new CustomItem("Полное укрытие ", "При полном укрытии вас нельзя атаковать и накладывать на васзаклинания."));

                intent.putExtra("CustomItems", m4);

                startActivityForResult(intent, 0);

                break;
            case 4:
                intent = new Intent(getContext(), HelpActivity.class);
                ArrayList<CustomItem> m5 = new ArrayList<>();

                m5.add(new CustomItem("Броня", "<table>\n" +
                        "    <tbody><tr class=\"table_header\">\n" +
                        "        <td>Доспех</td>\n" +
                        "        <td>Стоимость</td>\n" +
                        "        <td>Класс доспеха (КД)</td>\n" +
                        "        <td>Сила</td>\n" +
                        "        <td>Скрытность</td>\n" +
                        "        <td>Вес</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td colspan=\"6\"><strong><em>Лёгкий доспех</em></strong></td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Стеганый</td>\n" +
                        "        <td>5 зм.</td>\n" +
                        "        <td>11 + модификатор ЛОВ</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>8 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Кожаный</td>\n" +
                        "        <td>10 зм.</td>\n" +
                        "        <td>11 + модификатор ЛОВ</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>10 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Проклепанная кожа</td>\n" +
                        "        <td>45 зм.</td>\n" +
                        "        <td>12 + модификатор ЛОВ</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>13 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td colspan=\"6\"><strong><em>Средний доспех</em></strong></td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Шкурный</td>\n" +
                        "        <td>10 зм.</td>\n" +
                        "        <td>12 + модификатор ЛОВ (макс. 2)</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>12 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Кольчужная рубаха</td>\n" +
                        "        <td>50 зм.</td>\n" +
                        "        <td>13 + модификатор ЛОВ (макс. 2)</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>20 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Чешуйчатый</td>\n" +
                        "        <td>50 зм.</td>\n" +
                        "        <td>14 + модификатор ЛОВ (макс. 2)</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>45 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Кираса</td>\n" +
                        "        <td>400 зм.</td>\n" +
                        "        <td>14 + модификатор ЛОВ (макс. 2)</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>20 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Полулаты</td>\n" +
                        "        <td>750 зм.</td>\n" +
                        "        <td>15 + модификатор ЛОВ (макс. 2)</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>40 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td colspan=\"6\"><strong><em>Тяжелый доспех</em></strong></td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Колечный</td>\n" +
                        "        <td>30 зм.</td>\n" +
                        "        <td>14</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>40 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Кольчуга</td>\n" +
                        "        <td>75 зм.</td>\n" +
                        "        <td>16</td>\n" +
                        "        <td>13</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>55 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Наборный</td>\n" +
                        "        <td>200 зм.</td>\n" +
                        "        <td>17</td>\n" +
                        "        <td>15</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>60 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Латы</td>\n" +
                        "        <td>1 500 зм.</td>\n" +
                        "        <td>18</td>\n" +
                        "        <td>15</td>\n" +
                        "        <td>Помеха</td>\n" +
                        "        <td>65 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td colspan=\"6\"><strong><em>Щиты</em></strong></td>\n" +
                        "    </tr>\n" +
                        "    <tr>\n" +
                        "        <td> Щит</td>\n" +
                        "        <td>10 зм.</td>\n" +
                        "        <td>+2</td>\n" +
                        "        <td>-</td>\n" +
                        "        <td></td>\n" +
                        "        <td>6 фнт.</td>\n" +
                        "    </tr>\n" +
                        "    </tbody></table>"));

                intent.putExtra("CustomItems", m5);

                startActivityForResult(intent, 0);

                break;

            case 5:
                intent = new Intent(getContext(), HelpActivity.class);
                ArrayList<CustomItem> m6 = new ArrayList<>();

                m6.add(new CustomItem("Оружие", "<table>\n" +
                        " <tbody><tr class=\"table_header\">\n" +
                        " <td>Название</td>\n" +
                        " <td>Стоимость</td>\n" +
                        " <td>Урон</td>\n" +
                        " <td>Вес</td>\n" +
                        " <td>Свойства</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td colspan=\"5\"><strong><em>Простое рукопашное оружие</em></strong></td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Боевой посох</td>\n" +
                        " <td>2 см.</td>\n" +
                        " <td>1d6 дробящий</td>\n" +
                        " <td>4 фнт.</td>\n" +
                        " <td>Универсальное (1d8)</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Булава</td>\n" +
                        " <td>5 зм.</td>\n" +
                        " <td>1d6 дробящий</td>\n" +
                        " <td>4 фнт.</td>\n" +
                        " <td>-</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Дубинка</td>\n" +
                        " <td>1 см.</td>\n" +
                        " <td>1d4 дробящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Легкое </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Кинжал</td>\n" +
                        " <td>2 зм.</td>\n" +
                        " <td>1d4 колющий</td>\n" +
                        " <td>1 фнт.</td>\n" +
                        " <td>Легкое, метательное (дис. 20/60), фехтовальное </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Копье</td>\n" +
                        " <td>1 зм.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Метательное (дис. 20/60), универсальное (1d8) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Легкий молот</td>\n" +
                        " <td>2 зм.</td>\n" +
                        " <td>1d4 дробящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Легкое, метательное (дис. 20/60) \n" +
                        "</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Метательное копье</td>\n" +
                        " <td>5 см.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Метательное (дис. 30/120) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Палица</td>\n" +
                        " <td>2 см.</td>\n" +
                        " <td>1d8 дробящий</td>\n" +
                        " <td>10 фнт.</td>\n" +
                        " <td>Двуручное</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Ручной топор</td>\n" +
                        " <td>5 зм.</td>\n" +
                        " <td>1d6 рубящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Легкое, метательное (дис. 20/60) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Серп</td>\n" +
                        " <td>1 зм.</td>\n" +
                        " <td>1d4 рубящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Легкое \n" +
                        "</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td colspan=\"5\"><strong><em>Простое дальнобойное оружие</em></strong></td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Арбалет, легкий</td>\n" +
                        " <td>25 зм.</td>\n" +
                        " <td>1d8 колющий</td>\n" +
                        " <td>5 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 80/320), двуручное, перезарядка </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Дротик</td>\n" +
                        " <td>5 мм.</td>\n" +
                        " <td>1d4 колющий</td>\n" +
                        " <td>1/4 фнт.</td>\n" +
                        " <td>Метательное (дис. 20/60), фехтовальное </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Короткий лук</td>\n" +
                        " <td>25 зм.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 80/320), двуручное</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Праща</td>\n" +
                        " <td>1 см.</td>\n" +
                        " <td>1d4 дробящий</td>\n" +
                        " <td>-</td>\n" +
                        " <td>Боеприпас (дис. 30/120) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td colspan=\"5\"><strong><em>Воинское рукопашное оружие</em></strong></td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Алебарда</td>\n" +
                        " <td>20 зм.</td>\n" +
                        " <td>1d10 рубящий</td>\n" +
                        " <td>6 фнт.</td>\n" +
                        " <td>Двуручное, досягаемость, тяжелое</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Боевая кирка</td>\n" +
                        " <td>5 зм.</td>\n" +
                        " <td>1d8 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>-</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Боевой молот</td>\n" +
                        " <td>15 зм.</td>\n" +
                        " <td>1d8 дробящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Универсальное (1d10) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Боевой топор</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>1d8 рубящий</td>\n" +
                        " <td>4 фнт.</td>\n" +
                        " <td>Универсальное (1d10) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Глефа</td>\n" +
                        " <td>20 зм.</td>\n" +
                        " <td>1d10 рубящий</td>\n" +
                        " <td>6 фнт.</td>\n" +
                        " <td>Двуручное, досягаемость, тяжёлое </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Двуручный меч</td>\n" +
                        " <td>50 зм.</td>\n" +
                        " <td>2d6 рубящий</td>\n" +
                        " <td>6 фнт.</td>\n" +
                        " <td>Двуручное, тяжелое </td>\n" +
                        " </tr>\n" +
                        "<tr>\n" +
                        " <td> Длинное копье</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>1d12 колющий</td>\n" +
                        " <td>6 фнт.</td>\n" +
                        " <td>Досягаемость, особое</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Длинный меч</td>\n" +
                        " <td>15 зм.</td>\n" +
                        " <td>1d8 рубящий</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Универсальное (1d10) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Кнут</td>\n" +
                        " <td>2 зм.</td>\n" +
                        " <td>1d4 рубящий</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Досягаемость, фехтовальное</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Короткий меч</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Легкое, фехтовальное </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Молот</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>2d6 дробящий</td>\n" +
                        " <td>10 фнт.</td>\n" +
                        " <td>Двуручное, тяжелое</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Моргентштерн</td>\n" +
                        " <td>15 зм.</td>\n" +
                        " <td>1d8 колющий</td>\n" +
                        " <td>4 фнт.</td>\n" +
                        " <td>-</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Пика</td>\n" +
                        " <td>5 зм.</td>\n" +
                        " <td>1d10 колющий</td>\n" +
                        " <td>18 фнт.</td>\n" +
                        " <td>Двуручное, досягаемость, тяжёлое</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Рапира</td>\n" +
                        " <td>25 зм.</td>\n" +
                        " <td>1d8 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Фехтовальное</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Секира</td>\n" +
                        " <td>30 зм.</td>\n" +
                        " <td>1d12 рубящий</td>\n" +
                        " <td>7 фнт.</td>\n" +
                        " <td>Двуручное, тяжелое </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Скимитар</td>\n" +
                        " <td>25 зм.</td>\n" +
                        " <td>1d6 рубящий</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Легкое, фехтовальное </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Трезубец</td>\n" +
                        " <td>5 зм.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>4 фнт.</td>\n" +
                        " <td>Метательное (дис. 20/60), универсальное (1d8) </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Цеп</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>1d8 дробящий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>-</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td colspan=\"5\"><strong><em>Воинское дальнобойное оружие</em></strong></td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Арбалет, ручной</td>\n" +
                        " <td>75 зм.</td>\n" +
                        " <td>1d6 колющий</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 30/120), легкое, перезарядка </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Арбалет, тяжелый</td>\n" +
                        " <td>50 зм.</td>\n" +
                        " <td>1d10 колющий</td>\n" +
                        " <td>18 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 100/400), двуручное, перезарядка, тяжелое </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Длинный лук</td>\n" +
                        " <td>50 зм.</td>\n" +
                        " <td>1d8 колющий</td>\n" +
                        " <td>2 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 150/600), двуручное, тяжелое \n" +
                        "</td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Духовая трубка</td>\n" +
                        " <td>10 зм.</td>\n" +
                        " <td>1 колющий</td>\n" +
                        " <td>1 фнт.</td>\n" +
                        " <td>Боеприпас (дис. 25/100), перезарядка </td>\n" +
                        " </tr>\n" +
                        " <tr>\n" +
                        " <td> Сеть</td>\n" +
                        " <td>1 зм.</td>\n" +
                        " <td>-</td>\n" +
                        " <td>3 фнт.</td>\n" +
                        " <td>Метательное (дис. 5/15), особое </td>\n" +
                        " </tr>\n" +
                        "</tbody></table>"));

                intent.putExtra("CustomItems", m6);

                startActivityForResult(intent, 0);

                break;
        }
    }
}
